Revit 2026 API

# SolidComputeCentroid Method

---

Returns the Centroid of this solid.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ ComputeCentroid()
```
```vb
Public Function ComputeCentroid As XYZ
```
```cpp
public:
XYZ^ ComputeCentroid()
```
```fsharp
member ComputeCentroid : unit -> XYZ
```

#### Return Value

XYZThe XYZ point of the Centroid of this solid.

Calculates the centroid of the solid using an approximation, with an accuracy suitable for architectural purposes. This will correspond only with the center of gravity if the solid represents a homogeneous structure of a single material.

#### Reference

Solid Class

Autodesk.Revit.DB Namespace